citatos.org
* Todo
** Easy
   :LOGBOOK:
   - Note taken on [2021-09-04 Št 16:23] \\
     gdgfg
   :END:
- [ ] (need help) front page only one quote, not all of them. Next/previous/random buttons
- [X] <2021-09-04 Št> from which book the quote was taken from
- [X] <2021-09-04 Št> Navigation bar with sections(categories, athors, books, etc)
- [X] <2021-08-30 Pr> Karina helped with models, amazing, thanks!!
- [ ] <2021-08-30 Pr> First ever pull request with Git by Karina!!
** Moderate
- [ ] let users vote how much they like a certain quote (smiley faces like in some websites)
- [ ] breadcrums so the user doesnt get lost in the site /books/author/etc
- [ ] paspaudus ant quote - show other quotes to explore (related quotes)
** Difficult
- [ ] Let users publish their own quotes after I review them? idk sounds tough
- [ ] random quotes generator
  - [ ] tuscias langas su vienu mygtuku
  - [ ] paspaudus ant to mygtuko, virs jo islenda laukelis su randomly sugeneruota quote + author + category
  - [ ] paspaudus mygtuka dar karta - quote pasikeicia, atsiranda nauja vietoj jos

* About
