citatos.md

# Table of Contents

1.  [Todo](#orgb97cf08)
    1.  [Easy](#org26160cd)
    2.  [Moderate](#orgb683e29)
    3.  [Difficult](#orgddefaae)
2.  [About](#orgb5d2056)


<a id="orgb97cf08"></a>

# Todo


<a id="org26160cd"></a>

## Easy

-   [ ] (need help) front page only one quote, not all of them. Next/previous/random buttons
-   [X] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-04 Št&gt; </span></span> from which book the quote was taken from
-   [X] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-04 Št&gt; </span></span> Navigation bar with sections(categories, athors, books, etc)
-   [X] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-08-30 Pr&gt; </span></span> Karina helped with models, amazing, thanks!!
-   [ ] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-08-30 Pr&gt; </span></span> First ever pull request with Git by Karina!!


<a id="orgb683e29"></a>

## Moderate

-   [ ] let users vote how much they like a certain quote (smiley faces like in some websites)
-   [ ] breadcrums so the user doesnt get lost in the site /books/author/etc
-   [ ] paspaudus ant quote - show other quotes to explore (related quotes)


<a id="orgddefaae"></a>

## Difficult

-   [ ] Let users publish their own quotes after I review them? idk sounds tough
-   [ ] random quotes generator
    -   [ ] tuscias langas su vienu mygtuku
    -   [ ] paspaudus ant to mygtuko, virs jo islenda laukelis su randomly sugeneruota quote + author + category
    -   [ ] paspaudus mygtuka dar karta - quote pasikeicia, atsiranda nauja vietoj jos


<a id="orgb5d2056"></a>

# About

